RT-Thread/rt-thread/bsp/efm32/Libraries/CMSIS/CM3/DeviceSupport/EnergyMicro/EFM32/efm32g890f64.h
/** @} End of group EFM32G890F64_AF_Ports */

/**************************************************************************//**
 * @defgroup EFM32G890F64_AF_Pins EFM32G890F64 Alternate Function Pins
 * @{
 *****************************************************************************/

/** AF pin for function f */
#define AF_CMU_CLK0_PIN(f)         ((f) == 0 ? 2 : (f) == 1 ? 12 :  -1)
#define AF_CMU_CLK1_PIN(f)         ((f) == 0 ? 1 : (f) == 1 ? 8 :  -1)
#define AF_EBI_AD00_PIN(f)         ((f) == 0 ? 8 :  -1)
#define AF_EBI_AD01_PIN(f)         ((f) == 0 ? 9 :  -1)
#define AF_EBI_AD02_PIN(f)         ((f) == 0 ? 10 :  -1)
#define AF_EBI_AD03_PIN(f)         ((f) == 0 ? 11 :  -1)
#define AF_EBI_AD04_PIN(f)         ((f) == 0 ? 12 :  -1)
#define AF_EBI_AD05_PIN(f)         ((f) == 0 ? 13 :  -1)
#define AF_EBI_AD06_PIN(f)         ((f) == 0 ? 14 :  -1)
#define AF_EBI_AD07_PIN(f)         ((f) == 0 ? 15 :  -1)
#define AF_EBI_AD08_PIN(f)         ((f) == 0 ? 15 :  -1)
#define AF_EBI_AD09_PIN(f)         ((f) == 0 ? 0 :  -1)
#define AF_EBI_AD10_PIN(f)         ((f) == 0 ? 1 :  -1)
#define AF_EBI_AD11_PIN(f)         ((f) == 0 ? 2 :  -1)
#define AF_EBI_AD12_PIN(f)         ((f) == 0 ? 3 :  -1)
#define AF_EBI_AD13_PIN(f)         ((f) == 0 ? 4 :  -1)
#define AF_EBI_AD14_PIN(f)         ((f) == 0 ? 5 :  -1)
#define AF_EBI_AD15_PIN(f)         ((f) == 0 ? 6 :  -1)
#define AF_EBI_CS0_PIN(f)          ((f) == 0 ? 9 :  -1)
#define AF_EBI_CS1_PIN(f)          ((f) == 0 ? 10 :  -1)
#define AF_EBI_CS2_PIN(f)          ((f) == 0 ? 11 :  -1)
#define AF_EBI_CS3_PIN(f)          ((f) == 0 ? 12 :  -1)
#define AF_EBI_WEn_PIN(f)          ((f) == 0 ? 4 :  -1)
#define AF_EBI_REn_PIN(f)          ((f) == 0 ? 5 :  -1)
#define AF_EBI_ARDY_PIN(f)         ((f) == 0 ? 2 :  -1)
#define AF_EBI_ALE_PIN(f)          ((f) == 0 ? 3 :  -1)
#define AF_TIMER0_CC0_PIN(f)       ((f) == 0 ? 0 : (f) == 1 ? 0 : (f) == 2 ? 6 : (f) == 3 ? 1 :  -1)
#define AF_TIMER0_CC1_PIN(f)       ((f) == 0 ? 1 : (f) == 1 ? 1 : (f) == 2 ? 7 : (f) == 3 ? 2 :  -1)
#define AF_TIMER0_CC2_PIN(f)       ((f) == 0 ? 2 : (f) == 1 ? 2 : (f) == 2 ? 8 : (f) == 3 ? 3 :  -1)
#define AF_TIMER0_CDTI0_PIN(f)     ((f) == 0 ? 3 : (f) == 1 ? 13 : (f) == 2 ? 3 : (f) == 3 ? 13 :  -1)
#define AF_TIMER0_CDTI1_PIN(f)     ((f) == 0 ? 4 : (f) == 1 ? 14 : (f) == 2 ? 4 : (f) == 3 ? 14 :  -1)
#define AF_TIMER0_CDTI2_PIN(f)     ((f) == 0 ? 5 : (f) == 1 ? 15 : (f) == 2 ? 5 : (f) == 3 ? 15 :  -1)
#define AF_TIMER1_CC0_PIN(f)       ((f) == 0 ? 13 : (f) == 1 ? 10 : (f) == 2 ? 0 :  -1)
#define AF_TIMER1_CC1_PIN(f)       ((f) == 0 ? 14 : (f) == 1 ? 11 : (f) == 2 ? 1 :  -1)
#define AF_TIMER1_CC2_PIN(f)       ((f) == 0 ? 15 : (f) == 1 ? 12 : (f) == 2 ? 2 :  -1)
#define AF_TIMER1_CDTI0_PIN(f)     (-1)
#define AF_TIMER1_CDTI1_PIN(f)     (-1)
#define AF_TIMER1_CDTI2_PIN(f)     (-1)
#define AF_TIMER2_CC0_PIN(f)       ((f) == 0 ? 8 : (f) == 1 ? 12 : (f) == 2 ? 8 :  -1)
#define AF_TIMER2_CC1_PIN(f)       ((f) == 0 ? 9 : (f) == 1 ? 13 : (f) == 2 ? 9 :  -1)
#define AF_TIMER2_CC2_PIN(f)       ((f) == 0 ? 10 : (f) == 1 ? 14 : (f) == 2 ? 10 :  -1)
#define AF_TIMER2_CDTI0_PIN(f)     (-1)
#define AF_TIMER2_CDTI1_PIN(f)     (-1)
#define AF_TIMER2_CDTI2_PIN(f)     (-1)
#define AF_USART0_TX_PIN(f)        ((f) == 0 ? 10 : (f) == 1 ? 7 : (f) == 2 ? 11 :  -1)
#define AF_USART0_RX_PIN(f)        ((f) == 0 ? 11 : (f) == 1 ? 6 : (f) == 2 ? 10 :  -1)
#define AF_USART0_CLK_PIN(f)       ((f) == 0 ? 12 : (f) == 1 ? 5 : (f) == 2 ? 9 :  -1)
#define AF_USART0_CS_PIN(f)        ((f) == 0 ? 13 : (f) == 1 ? 4 : (f) == 2 ? 8 :  -1)
#define AF_USART1_TX_PIN(f)        ((f) == 0 ? 0 : (f) == 1 ? 0 :  -1)
#define AF_USART1_RX_PIN(f)        ((f) == 0 ? 1 : (f) == 1 ? 1 :  -1)
#define AF_USART1_CLK_PIN(f)       ((f) == 0 ? 7 : (f) == 1 ? 2 :  -1)
#define AF_USART1_CS_PIN(f)        ((f) == 0 ? 8 : (f) == 1 ? 3 :  -1)
#define AF_USART2_TX_PIN(f)        ((f) == 0 ? 2 : (f) == 1 ? 3 :  -1)
#define AF_USART2_RX_PIN(f)        ((f) == 0 ? 3 : (f) == 1 ? 4 :  -1)
#define AF_USART2_CLK_PIN(f)       ((f) == 0 ? 4 : (f) == 1 ? 5 :  -1)
#define AF_USART2_CS_PIN(f)        ((f) == 0 ? 5 : (f) == 1 ? 6 :  -1)
#define AF_UART0_TX_PIN(f)         ((f) == 0 ? 6 : (f) == 1 ? 0 : (f) == 2 ? 3 : (f) == 3 ? 14 :  -1)
#define AF_UART0_RX_PIN(f)         ((f) == 0 ? 7 : (f) == 1 ? 1 : (f) == 2 ? 4 : (f) == 3 ? 15 :  -1)
#define AF_UART0_CLK_PIN(f)        (-1)
#define AF_UART0_CS_PIN(f)         (-1)
#define AF_LEUART0_TX_PIN(f)       ((f) == 0 ? 4 : (f) == 1 ? 13 : (f) == 2 ? 14 :  -1)
#define AF_LEUART0_RX_PIN(f)       ((f) == 0 ? 5 : (f) == 1 ? 14 : (f) == 2 ? 15 :  -1)
#define AF_LEUART1_TX_PIN(f)       ((f) == 0 ? 6 : (f) == 1 ? 5 :  -1)
#define AF_LEUART1_RX_PIN(f)       ((f) == 0 ? 7 : (f) == 1 ? 6 :  -1)
#define AF_LETIMER0_OUT0_PIN(f)    ((f) == 0 ? 6 : (f) == 1 ? 11 : (f) == 2 ? 0 : (f) == 3 ? 4 :  -1)
#define AF_LETIMER0_OUT1_PIN(f)    ((f) == 0 ? 7 : (f) == 1 ? 12 : (f) == 2 ? 1 : (f) == 3 ? 5 :  -1)
#define AF_PCNT0_S0IN_PIN(f)       ((f) == 0 ? 13 : (f) == 1 ? 0 : (f) == 2 ? 0 :  -1)
#define AF_PCNT0_S1IN_PIN(f)       ((f) == 0 ? 14 : (f) == 1 ? 1 : (f) == 2 ? 1 :  -1)
#define AF_PCNT1_S0IN_PIN(f)       ((f) == 0 ? 4 : (f) == 1 ? 3 :  -1)
#define AF_PCNT1_S1IN_PIN(f)       ((f) == 0 ? 5 : (f) == 1 ? 4 :  -1)
#define AF_PCNT2_S0IN_PIN(f)       ((f) == 0 ? 0 : (f) == 1 ? 8 :  -1)
#define AF_PCNT2_S1IN_PIN(f)       ((f) == 0 ? 1 : (f) == 1 ? 9 :  -1)
#define AF_I2C0_SDA_PIN(f)         ((f) == 0 ? 0 : (f) == 1 ? 6 : (f) == 2 ? 6 : (f) == 3 ? 14 :  -1)
#define AF_I2C0_SCL_PIN(f)         ((f) == 0 ? 1 : (f) == 1 ? 7 : (f) == 2 ? 7 : (f) == 3 ? 15 :  -1)
#define AF_ACMP0_OUT_PIN(f)        ((f) == 0 ? 13 : (f) == 1 ? 2 :  -1)
#define AF_ACMP1_OUT_PIN(f)        ((f) == 0 ? 2 : (f) == 1 ? 3 :  -1)
#define AF_DBG_SWO_PIN(f)          ((f) == 0 ? 2 : (f) == 1 ? 15 :  -1)
#define AF_DBG_SWDIO_PIN(f)        ((f) == 0 ? 1 : (f) == 1 ? 1 :  -1)
#define AF_DBG_SWCLK_PIN(f)        ((f) == 0 ? 0 : (f) == 1 ? 0 :  -1)

/** @} End of group EFM32G890F64_AF_Pins */

/** Grouped by channel c, function f */
#define AF_PORT(c, f)    (                   \
    (c) == 0 ? AF_CMU_CLK0_PORT((f)) :       \
    (c) == 1 ? AF_CMU_CLK1_PORT((f)) :       \
    (c) == 2 ? AF_EBI_AD00_PORT((f)) :       \
    (c) == 3 ? AF_EBI_AD01_PORT((f)) :       \
    (c) == 4 ? AF_EBI_AD02_PORT((f)) :       \
    (c) == 5 ? AF_EBI_AD03_PORT((f)) :       \
    (c) == 6 ? AF_EBI_AD04_PORT((f)) :       \
    (c) == 7 ? AF_EBI_AD05_PORT((f)) :       \
    (c) == 8 ? AF_EBI_AD06_PORT((f)) :       \
    (c) == 9 ? AF_EBI_AD07_PORT((f)) :       \
    (c) == 10 ? AF_EBI_AD08_PORT((f)) :      \
    (c) == 11 ? AF_EBI_AD09_PORT((f)) :      \
    (c) == 12 ? AF_EBI_AD10_PORT((f)) :      \
    (c) == 13 ? AF_EBI_AD11_PORT((f)) :      \
    (c) == 14 ? AF_EBI_AD12_PORT((f)) :      \
    (c) == 15 ? AF_EBI_AD13_PORT((f)) :      \
    (c) == 16 ? AF_EBI_AD14_PORT((f)) :      \
    (c) == 17 ? AF_EBI_AD15_PORT((f)) :      \
    (c) == 18 ? AF_EBI_CS0_PORT((f)) :       \
    (c) == 19 ? AF_EBI_CS1_PORT((f)) :       \
    (c) == 20 ? AF_EBI_CS2_PORT((f)) :       \
    (c) == 21 ? AF_EBI_CS3_PORT((f)) :       \
    (c) == 22 ? AF_EBI_WEn_PORT((f)) :       \
    (c) == 23 ? AF_EBI_REn_PORT((f)) :       \
    (c) == 24 ? AF_EBI_ARDY_PORT((f)) :      \
    (c) == 25 ? AF_EBI_ALE_PORT((f)) :       \
    (c) == 26 ? AF_TIMER0_CC0_PORT((f)) :    \
    (c) == 27 ? AF_TIMER0_CC1_PORT((f)) :    \
    (c) == 28 ? AF_TIMER0_CC2_PORT((f)) :    \
    (c) == 29 ? AF_TIMER0_CDTI0_PORT((f)) :  \
    (c) == 30 ? AF_TIMER0_CDTI1_PORT((f)) :  \
    (c) == 31 ? AF_TIMER0_CDTI2_PORT((f)) :  \
    (c) == 32 ? AF_TIMER1_CC0_PORT((f)) :    \
    (c) == 33 ? AF_TIMER1_CC1_PORT((f)) :    \
    (c) == 34 ? AF_TIMER1_CC2_PORT((f)) :    \
    (c) == 35 ? AF_TIMER1_CDTI0_PORT((f)) :  \
    (c) == 36 ? AF_TIMER1_CDTI1_PORT((f)) :  \
    (c) == 37 ? AF_TIMER1_CDTI2_PORT((f)) :  \
    (c) == 38 ? AF_TIMER2_CC0_PORT((f)) :    \
    (c) == 39 ? AF_TIMER2_CC1_PORT((f)) :    \
    (c) == 40 ? AF_TIMER2_CC2_PORT((f)) :    \
    (c) == 41 ? AF_TIMER2_CDTI0_PORT((f)) :  \
    (c) == 42 ? AF_TIMER2_CDTI1_PORT((f)) :  \
    (c) == 43 ? AF_TIMER2_CDTI2_PORT((f)) :  \
    (c) == 44 ? AF_USART0_TX_PORT((f)) :     \
    (c) == 45 ? AF_USART0_RX_PORT((f)) :     \
    (c) == 46 ? AF_USART0_CLK_PORT((f)) :    \
    (c) == 47 ? AF_USART0_CS_PORT((f)) :     \
    (c) == 48 ? AF_USART1_TX_PORT((f)) :     \
    (c) == 49 ? AF_USART1_RX_PORT((f)) :     \
    (c) == 50 ? AF_USART1_CLK_PORT((f)) :    \
    (c) == 51 ? AF_USART1_CS_PORT((f)) :     \
    (c) == 52 ? AF_USART2_TX_PORT((f)) :     \
    (c) == 53 ? AF_USART2_RX_PORT((f)) :     \
    (c) == 54 ? AF_USART2_CLK_PORT((f)) :    \
    (c) == 55 ? AF_USART2_CS_PORT((f)) :     \
    (c) == 56 ? AF_UART0_TX_PORT((f)) :      \
    (c) == 57 ? AF_UART0_RX_PORT((f)) :      \
    (c) == 58 ? AF_UART0_CLK_PORT((f)) :     \
    (c) == 59 ? AF_UART0_CS_PORT((f)) :      \
    (c) == 60 ? AF_LEUART0_TX_PORT((f)) :    \
    (c) == 61 ? AF_LEUART0_RX_PORT((f)) :    \
    (c) == 62 ? AF_LEUART1_TX_PORT((f)) :    \
    (c) == 63 ? AF_LEUART1_RX_PORT((f)) :    \
    (c) == 64 ? AF_LETIMER0_OUT0_PORT((f)) : \
    (c) == 65 ? AF_LETIMER0_OUT1_PORT((f)) : \
    (c) == 66 ? AF_PCNT0_S0IN_PORT((f)) :    \
    (c) == 67 ? AF_PCNT0_S1IN_PORT((f)) :    \
    (c) == 68 ? AF_PCNT1_S0IN_PORT((f)) :    \
    (c) == 69 ? AF_PCNT1_S1IN_PORT((f)) :    \
    (c) == 70 ? AF_PCNT2_S0IN_PORT((f)) :    \
    (c) == 71 ? AF_PCNT2_S1IN_PORT((f)) :    \
    (c) == 72 ? AF_I2C0_SDA_PORT((f)) :      \
    (c) == 73 ? AF_I2C0_SCL_PORT((f)) :      \
    (c) == 74 ? AF_ACMP0_OUT_PORT((f)) :     \
    (c) == 75 ? AF_ACMP1_OUT_PORT((f)) :     \
    (c) == 76 ? AF_DBG_SWO_PORT((f)) :       \
    (c) == 77 ? AF_DBG_SWDIO_PORT((f)) :     \
    (c) == 78 ? AF_DBG_SWCLK_PORT((f)) :     \
    -1)

